
## Plan Result

[CI link](https://github.com/hawk0616/recruit-service-board-infla/actions/runs/6138313611)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 3 to change, 1 to destroy.</code></pre>

* Create
  * module.vpc.aws_eip.nat[1]
  * module.vpc.aws_nat_gateway.this[1]
  * module.vpc.aws_route.private_nat_gateway[1]
  * module.vpc.aws_route_table.private[1]
* Update
  * module.vpc.aws_route.private_nat_gateway[0]
  * module.vpc.aws_route_table.private[0]
  * module.vpc.aws_route_table_association.private[1]
* Replace
  * module.vpc.aws_nat_gateway.this[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.vpc.aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
      + tags_all             = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] must be replaced
-/+ resource "aws_nat_gateway" "this" {
      ~ allocation_id        = "eipalloc-09fbc8a2cc5227fc3" # forces replacement -> (known after apply) # forces replacement
      ~ association_id       = "eipassoc-0fef2f53518d06c59" -> (known after apply)
      ~ id                   = "nat-048f407a5f7b59690" -> (known after apply)
      ~ network_interface_id = "eni-01f69d364f32f02c7" -> (known after apply)
      ~ private_ip           = "10.0.11.165" -> (known after apply)
      ~ public_ip            = "52.68.111.132" -> (known after apply)
        tags                 = {
            "Name" = "aws-ecs-terraform-ap-northeast-1a"
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-045bc34d7c279cb27"
      + tags                 = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
      + tags_all             = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be updated in-place
  ~ resource "aws_route" "private_nat_gateway" {
        id                     = "r-rtb-0c5a36c42816c6a6e1080289494"
      ~ nat_gateway_id         = "nat-048f407a5f7b59690" -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0c5a36c42816c6a6e"
      ~ tags             = {
          ~ "Name" = "aws-ecs-terraform-private" -> "aws-ecs-terraform-private-ap-northeast-1a"
        }
      ~ tags_all         = {
          ~ "Name" = "aws-ecs-terraform-private" -> "aws-ecs-terraform-private-ap-northeast-1a"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "aws-ecs-terraform-private-ap-northeast-1c"
        }
      + tags_all         = {
          + "Name" = "aws-ecs-terraform-private-ap-northeast-1c"
        }
      + vpc_id           = "vpc-06a74de91e584f523"
    }

  # module.vpc.aws_route_table_association.private[1] will be updated in-place
  ~ resource "aws_route_table_association" "private" {
        id             = "rtbassoc-0c8a12a9773686205"
      ~ route_table_id = "rtb-0c5a36c42816c6a6e" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 5 to add, 3 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"d6d8913353a935cd14d7c7f4913fbec8061a486b","Vars":{},"WorkflowName":"Terraform"} -->